#+TITLE: Indexed Linked List
#+DATE: <2020-08-05 mié>
#+AUTHOR: José Jorge Rodríguez Salgado
#+EMAIL: josejorgexl@gmail.com
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:t f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
#+CREATOR: Emacs 25.2.2 (Org mode 8.2.10)
#+DESCRIPTION: A data structure named Indexed Linked List that allow to insert, remove and read in O(sqrt(N)) operations
#+EXCLUDE_TAGS: noexport
#+KEYWORDS: Data structure, list, linked list, runtime complexity
#+LANGUAGE: en
#+SELECT_TAGS: export

** Test

#+BEGIN_SRC lisp +n -r :results output :exports code :tangle src/indexed-linked-list.test.lisp 
(let ((node1 (il-node 1 nil nil))
      (node2 (il-node 2 nil nil))
      (node3 (il-node 3 nil nil)))
    (progn
        (setf (next node1) node2)
        (setf (prev node2) node1)
        (setf (prev node3) node2)
        (setf (next node2) node3)
        (format t "NODE 1:~%  CONTENT: ~A~%  PREV: ~A~%  NEXT: ~A~%" (content node1) (prev node1) (content (next node1)))
        (format t "NODE 2:~%  CONTENT: ~A~%  PREV: ~A~%  NEXT: ~A~%" (content node2) (content (prev node2)) (content (next node2)))
        (format t "NODE 3:~%  CONTENT: ~A~%  PREV: ~A~%  NEXT: ~A~%" (content node3) (content(prev node3)) (next node3))))
#+END_SRC

#+RESULTS:
#+begin_example
NODE 1:
  CONTENT: 1
  PREV: NIL
  NEXT: 2
NODE 2:
  CONTENT: 2
  PREV: 1
  NEXT: 3
NODE 3:
  CONTENT: 3
  PREV: 2
  NEXT: NIL
#+end_example
*** Test
#+BEGIN_SRC lisp +n -r :results output :exports both :tangle src/indexed-linked-list.test.lisp
(progn
     (format t "FOR a = 1 sould be 0: ~A~%" (integer-positive-root 1))
     (format t "FOR a = 2 sould be 1: ~A~%" (integer-positive-root 2))
     (format t "FOR a = 7 sould be 2: ~A~%" (integer-positive-root 7))
     (format t "FOR a = 15 sould be 3: ~A~%" (integer-positive-root 15)))
#+END_SRC

#+RESULTS:
: FOR a = 1 sould be 0: 0
: FOR a = 2 sould be 1: 1
: FOR a = 7 sould be 2: 2
: FOR a = 15 sould be 3: 3

*** Test
#+BEGIN_SRC lisp +n -r :results output :exports both :tangle src/indexed-linked-list.test.lisp 
(let ((ill (indexed-linked-list 1 2 3 4 5 6)))
         (format t "SHOULD BE 2: ~A~%" (content (prevn (nextn (first (selected-nodes ill)) 3) 3))))
#+END_SRC

#+RESULTS:
: SHOULD BE 2: 2

*** Test

#+BEGIN_SRC lisp +n -r :results output :exports code :tangle src/indexed-linked-list.test.lisp
(let ((ill (indexed-linked-list 1 2 3)))
     
     (progn
         (format t "~A~%" (content (next (first (selected-nodes ill)))))
         (insert ill 4)
         (format t "~A~%" (selected-nodes ill))
         (format t "~A~%" (content (prev (first (selected-nodes ill)))))
         (format t "~A~%" (content (next (first (selected-nodes ill))))))
         (format t "~A~%" (content (next (next (first (selected-nodes ill)))))))
#+END_SRC

#+RESULTS:
: 2
: (#<ILL-NODE {1003458803}> #<ILL-NODE {1003458883}>)
: 1
: 3
: 4
*** Test
#+BEGIN_SRC lisp +n -r :results output :exports both :tangle src/indexed-linked-list.test.lisp 
(let ((ill (indexed-linked-list 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17)))
     (progn
         (format t "SHOULD BE 1: ~A~%"  (content (get-at ill 0))    )
         (format t "SHOULD BE 5: ~A~%"  (content (get-at ill 4))    )
         (format t "SHOULD BE 9: ~A~%"  (content (get-at ill 8))    )
         (format t "SHOULD BE 13: ~A~%" (content  (get-at ill 12))  )
         (format t "SHOULD BE 17: ~A~%" (content  (get-at ill 16)))))
#+END_SRC

#+RESULTS:
: SHOULD BE 1: 1
: SHOULD BE 5: 5
: SHOULD BE 9: 9
: SHOULD BE 13: 13
: SHOULD BE 17: 17

*** Test
#+BEGIN_SRC lisp +n -r :results output :exports code :tangle src/indexed-linked-list.test.lisp
(let ((ill (indexed-linked-list 1 2 3)))
     
     (progn
         (format t "~A~%" (mapcar #'content (selected-nodes ill)))
         (format t "SHOULD BE 2: ~A~%" (content (next (first (selected-nodes ill)))))
         (insert-after ill 4 1)
         (format t "~A~%" (mapcar #'content (selected-nodes ill)))
         (format t "SHOULD BE 4: ~A~%" (content (next (first (selected-nodes ill)))))
         (insert-before ill 5 3)
         (format t "~A~%" (mapcar #'content (selected-nodes ill)))
         (format t "SHOULD BE 5: ~A~%" (content (next (next (first (selected-nodes ill))))))))
#+END_SRC

#+RESULTS:
: (1)
: SHOULD BE 2: 2
: (2 3)
: SHOULD BE 4: 4
: (2 3)
: SHOULD BE 5: 5

*** Test
#+BEGIN_SRC lisp +n -r :results output :exports code :tangle src/indexed-linked-list.test.lisp
(let ((ill (indexed-linked-list 1 2 3 4 5)))
     
     (progn
          (format t "SN:~%~A~%" (mapcar #'content (selected-nodes ill)))
          (remove-at ill 1)
          (format t "REMOVING 2:~%")
          (print-ill ill)
          (format t "SN:~%~A~%" (mapcar #'content (selected-nodes ill)))
          (remove-at ill 3)
          (format t "REMOVING 5:~%")
          (print-ill ill)
          (format t "SN:~%~A~%" (mapcar #'content (selected-nodes ill)))))
#+END_SRC

#+RESULTS:
#+begin_example
SN:
(2 4)
REMOVING 2:
( 1 3 4 5 )
SN:
(3 5)
REMOVING 5:
( 1 3 4 )
SN:
(1)
#+end_example

